Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>plprobelab</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.this["probelab-cmi"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "probelab-cmi"
    }

  # github_team.this["probelab-bots"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Bot users that ProbeLab uses to automate their infrastructure"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "probelab-bots"
      + node_id                   = (known after apply)
      + privacy                   = "secret"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["probelab-bots:probelab-cmi"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "probelab-cmi"
    }

  # github_team_membership.this["probelab-bots:web3-bot"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "web3-bot"
    }

  # github_team_repository.this["probelab-core:network-measurements"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "7597558:network-measurements"
      ~ permission = "pull" -> "admin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["probelab-core:tracecatcher"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "7597558:tracecatcher"
      ~ permission = "pull" -> "admin"
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->